# Pandas

![](https://quera.ir/qbox/view/yhNRcnAWD9/pandas.jpg)

In [1]:
%pip install pandas

Collecting pandas
  Using cached pandas-2.0.1-cp311-cp311-macosx_10_9_x86_64.whl (11.6 MB)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/mac/Library/Python/3.11/lib/python/site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1
  Using cached pytz-2023.3-py2.py3-none-any.whl (502 kB)
Collecting tzdata>=2022.1
  Using cached tzdata-2023.3-py2.py3-none-any.whl (341 kB)
Requirement already satisfied: numpy>=1.21.0 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in /Users/mac/Library/Python/3.11/lib/python/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.0.1 pytz-2023.3 tzdata-2023.3

[notice] A new release of pip available: 22.3.1 -> 23.1.2
[notice] To update, run: python3 -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

# Data Series

In [1]:
import pandas as pd
import numpy as np

s_int = pd.Series([1,2,3,4,5])

s_float = pd.Series([1.1, 2.2 ,3.3, 4.4])

s_str = pd.Series(["parsa", "parto", "hamed", "sajjad"])

In [2]:
s = pd.Series([-1,4,-3])
s

0   -1
1    4
2   -3
dtype: int64

In [3]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [5]:
s.values

array([-1,  4, -3])

![](https://quera.org/qbox/view/b3ncQEIlqm/series.jpg)

In [6]:
type(s.values)

numpy.ndarray

In [8]:
s.to_list()

[-1, 4, -3]

In [9]:
np.max(s)

4

In [10]:
s = pd.Series([19, 16, 20], index= ["a","b","c"])
s

a    19
b    16
c    20
dtype: int64

In [11]:
s.index = ['ali', 'gholi', 'vali']
s

ali      19
gholi    16
vali     20
dtype: int64

In [12]:
s[1]

16

In [13]:
s['gholi']

16

In [14]:
s['gholi'] = 20
s

ali      19
gholi    20
vali     20
dtype: int64

In [15]:
purity_dictionary = {
"Ali" : 19 ,
"Gholi" : 16 ,
"Vali" : 20
}

purity_series = pd.Series(purity_dictionary)
purity_series

Ali      19
Gholi    16
Vali     20
dtype: int64

# DataFrame

In [16]:
import pandas as pd
import numpy as np

cars_dictionary = {
    "model" :[ "Peykan", "BMW X6", "Peugeot 206", "Tiba", "Nissan Junior", "Peykan Vanet", "renault 5"],
    "Color" :["Red", "White", "Black", "White", "Blue", "Red", "Silver"],
    "HP" :[48, 335, 105, 87, 93, 80, 48],
    "Weight (KG)": [990, 2320, 1025, 1027, 1540, 960, 850],
    "price" :[33, 2400, 105, 120, 230, 68, 38]
}

df = pd.DataFrame(cars_dictionary)

df

           model   Color   HP  Weight (KG)  price
0         Peykan     Red   48          990     33
1         BMW X6   White  335         2320   2400
2    Peugeot 206   Black  105         1025    105
3           Tiba   White   87         1027    120
4  Nissan Junior    Blue   93         1540    230
5   Peykan Vanet     Red   80          960     68
6      renault 5  Silver   48          850     38

In [17]:
df.columns

Index(['model', 'Color', 'HP', 'Weight (KG)', 'price'], dtype='object')

In [18]:
type(df.columns)

pandas.core.indexes.base.Index

In [19]:
df.columns.tolist()

['model', 'Color', 'HP', 'Weight (KG)', 'price']

In [20]:
df.columns.to_numpy()

array(['model', 'Color', 'HP', 'Weight (KG)', 'price'], dtype=object)

In [21]:
df.index

RangeIndex(start=0, stop=7, step=1)

![](https://quera.org/qbox/view/xAhilaZMRL/col%20and%20index.gif)

In [22]:
df["Color"]

0       Red
1     White
2     Black
3     White
4      Blue
5       Red
6    Silver
Name: Color, dtype: object

In [23]:
df.iloc[0] #not df[0]

model          Peykan
Color             Red
HP                 48
Weight (KG)       990
price              33
Name: 0, dtype: object

![](https://quera.org/qbox/view/fUQOensQs0/both%20are%20series.gif)

In [26]:
df.values

array([['Peykan', 'Red', 48, 990, 33],
       ['BMW X6', 'White', 335, 2320, 2400],
       ['Peugeot 206', 'Black', 105, 1025, 105],
       ['Tiba', 'White', 87, 1027, 120],
       ['Nissan Junior', 'Blue', 93, 1540, 230],
       ['Peykan Vanet', 'Red', 80, 960, 68],
       ['renault 5', 'Silver', 48, 850, 38]], dtype=object)

In [27]:
df2 = pd.DataFrame([['Peykan', 'Red', 48, 990, 33],
       ['BMW X6', 'White', 335, 2320, 2400],
       ['Peugeot 206', 'Black', 105, 1025, 105],
       ['Tiba', 'White', 87, 1027, 120],
       ['Nissan Junior', 'Blue', 93, 1540, 230],
       ['Nissan Junior', 'Red', 93, 1540, 186],
       ['renault 5', 'Silver', 48, 850, 38]])
df2

               0       1    2     3     4
0         Peykan     Red   48   990    33
1         BMW X6   White  335  2320  2400
2    Peugeot 206   Black  105  1025   105
3           Tiba   White   87  1027   120
4  Nissan Junior    Blue   93  1540   230
5  Nissan Junior     Red   93  1540   186
6      renault 5  Silver   48   850    38

In [28]:
df2 = pd.DataFrame([['Peykan', 'Red', 48, 990, 33],
       ['BMW X6', 'White', 335, 2320, 2400],
       ['Peugeot 206', 'Black', 105, 1025, 105],
       ['Tiba', 'White', 87, 1027, 120],
       ['Nissan Junior', 'Blue', 93, 1540, 230],
       ['Nissan Junior', 'Red', 93, 1540, 186],
       ['renault 5', 'Silver', 48, 850, 38]],
       index = ['a','b','c','d','e','f','g'],
       columns= ['model' , 'Color' , 'HP', 'Weight (KG)', 'price'])
df2

           model   Color   HP  Weight (KG)  price
a         Peykan     Red   48          990     33
b         BMW X6   White  335         2320   2400
c    Peugeot 206   Black  105         1025    105
d           Tiba   White   87         1027    120
e  Nissan Junior    Blue   93         1540    230
f  Nissan Junior     Red   93         1540    186
g      renault 5  Silver   48          850     38

In [29]:
df.head()

           model  Color   HP  Weight (KG)  price
0         Peykan    Red   48          990     33
1         BMW X6  White  335         2320   2400
2    Peugeot 206  Black  105         1025    105
3           Tiba  White   87         1027    120
4  Nissan Junior   Blue   93         1540    230

In [30]:
df.tail()

           model   Color   HP  Weight (KG)  price
2    Peugeot 206   Black  105         1025    105
3           Tiba   White   87         1027    120
4  Nissan Junior    Blue   93         1540    230
5   Peykan Vanet     Red   80          960     68
6      renault 5  Silver   48          850     38

In [31]:
df.head(6)

           model  Color   HP  Weight (KG)  price
0         Peykan    Red   48          990     33
1         BMW X6  White  335         2320   2400
2    Peugeot 206  Black  105         1025    105
3           Tiba  White   87         1027    120
4  Nissan Junior   Blue   93         1540    230
5   Peykan Vanet    Red   80          960     68

In [32]:
df.sample(4 , random_state = 42)

          model  Color   HP  Weight (KG)  price
0        Peykan    Red   48          990     33
1        BMW X6  White  335         2320   2400
5  Peykan Vanet    Red   80          960     68
2   Peugeot 206  Black  105         1025    105

In [33]:
df.sample(frac=0.4 , random_state = 42)

          model  Color   HP  Weight (KG)  price
0        Peykan    Red   48          990     33
1        BMW X6  White  335         2320   2400
5  Peykan Vanet    Red   80          960     68

In [34]:
df.sample(frac=0.4, ignore_index=True , random_state = 42)

          model  Color   HP  Weight (KG)  price
0        Peykan    Red   48          990     33
1        BMW X6  White  335         2320   2400
2  Peykan Vanet    Red   80          960     68

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   model        7 non-null      object
 1   Color        7 non-null      object
 2   HP           7 non-null      int64
 3   Weight (KG)  7 non-null      int64
 4   price        7 non-null      int64
dtypes: int64(3), object(2)
memory usage: 412.0+ bytes

In [36]:
df.describe()

               HP  Weight (KG)        price
count    7.000000     7.000000     7.000000
mean   113.714286  1244.571429   427.714286
std     99.966185   522.948008   872.248572
min     48.000000   850.000000    33.000000
25%     64.000000   975.000000    53.000000
50%     87.000000  1025.000000   105.000000
75%     99.000000  1283.500000   175.000000
max    335.000000  2320.000000  2400.000000

In [37]:
df["Color"].value_counts()

Color
Red       2
White     2
Black     1
Blue      1
Silver    1
Name: count, dtype: int64

# Working with DataFrame

In [38]:
import pandas as pd
import numpy as np

cars_dictionary = {
    "Color" :["Red", "White", "Black", "White", "Blue", "Red", "Silver"],
    "HP" :[48, 335, 105, 87, 93, 80, 48],
    "Weight (KG)": [990, 2320, 1025, 1027, 1540, 960, 850],
    "price" :[33, 2400, 105, 120, 230, 68, 38]
}

df = pd.DataFrame(cars_dictionary , index = [ "Peykan", "BMW X6", "Peugeot 206", "Tiba", "Nissan Junior", "Peykan Vanet", "renault 5"])

df

                Color   HP  Weight (KG)  price
Peykan            Red   48          990     33
BMW X6          White  335         2320   2400
Peugeot 206     Black  105         1025    105
Tiba            White   87         1027    120
Nissan Junior    Blue   93         1540    230
Peykan Vanet      Red   80          960     68
renault 5      Silver   48          850     38

In [39]:
cars_dictionary["Color"]

['Red', 'White', 'Black', 'White', 'Blue', 'Red', 'Silver']

In [40]:
df["Color"]

Peykan              Red
BMW X6            White
Peugeot 206       Black
Tiba              White
Nissan Junior      Blue
Peykan Vanet        Red
renault 5        Silver
Name: Color, dtype: object

In [41]:
df.Color

Peykan              Red
BMW X6            White
Peugeot 206       Black
Tiba              White
Nissan Junior      Blue
Peykan Vanet        Red
renault 5        Silver
Name: Color, dtype: object

In [42]:
for c in df.columns:
    print(c)
    print(df[c].count())

Color
7
HP
7
Weight (KG)
7
price
7

In [43]:
df[["Color" , "price"]]

                Color  price
Peykan            Red     33
BMW X6          White   2400
Peugeot 206     Black    105
Tiba            White    120
Nissan Junior    Blue    230
Peykan Vanet      Red     68
renault 5      Silver     38

In [44]:
df.iloc[2]

Color          Black
HP               105
Weight (KG)     1025
price            105
Name: Peugeot 206, dtype: object

In [45]:
df.loc["Tiba"]

Color          White
HP                87
Weight (KG)     1027
price            120
Name: Tiba, dtype: object

![](https://quera.org/qbox/view/tlgYHWnNKC/loc%20iloc%20v2.gif)

In [46]:
cars_dictionary = {
    "Color" :["Red", "White", "Black", "White", "Blue", "Red", "Silver"],
    "HP" :[48, 335, 105, 87, 93, 80, 48],
    "Weight (KG)": [990, 2320, 1025, 1027, 1540, 960, 850],
    "price" :[33, 2400, 105, 120, 230, 68, 38]
}

df2 = pd.DataFrame(cars_dictionary )

df2

    Color   HP  Weight (KG)  price
0     Red   48          990     33
1   White  335         2320   2400
2   Black  105         1025    105
3   White   87         1027    120
4    Blue   93         1540    230
5     Red   80          960     68
6  Silver   48          850     38

In [47]:
df2.loc[3]

Color          White
HP                87
Weight (KG)     1027
price            120
Name: 3, dtype: object

In [48]:
arr = np.arange(16).reshape(4, 4)
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [50]:
arr[2,3]

11

In [51]:
df

                Color   HP  Weight (KG)  price
Peykan            Red   48          990     33
BMW X6          White  335         2320   2400
Peugeot 206     Black  105         1025    105
Tiba            White   87         1027    120
Nissan Junior    Blue   93         1540    230
Peykan Vanet      Red   80          960     68
renault 5      Silver   48          850     38

In [52]:
df.iloc[2,3]

105

In [53]:
df.iloc[[2,3], 1:3]

              HP  Weight (KG)
Peugeot 206  105         1025
Tiba          87         1027

In [54]:
df.loc["Peugeot 206", "price"]

105

In [55]:
df.loc[["Peugeot 206","Tiba"] , "HP":"price"]

              HP  Weight (KG)  price
Peugeot 206  105         1025    105
Tiba          87         1027    120

---

In [56]:
import pandas as pd
import numpy as np

cars_dictionary = {
    "Color" :["Red", "White", "Black", "White", "Blue", "Red", "Silver"],
    "HP" :[48, 335, 105, 87, 93, 80, 48],
    "Weight (KG)": [990, 2320, 1025, 1027, 1540, 960, 850],
    "price" :[33, 2400, 105, 120, 230, 68, 38]
}

df = pd.DataFrame(cars_dictionary , index = [ "Peykan", "BMW X6", "Peugeot 206", "Tiba", "Nissan Junior", "Peykan Vanet", "renault 5"])

df

                Color   HP  Weight (KG)  price
Peykan            Red   48          990     33
BMW X6          White  335         2320   2400
Peugeot 206     Black  105         1025    105
Tiba            White   87         1027    120
Nissan Junior    Blue   93         1540    230
Peykan Vanet      Red   80          960     68
renault 5      Silver   48          850     38

In [57]:
df.price

Peykan             33
BMW X6           2400
Peugeot 206       105
Tiba              120
Nissan Junior     230
Peykan Vanet       68
renault 5          38
Name: price, dtype: int64

In [58]:
df.price > 110

Peykan           False
BMW X6            True
Peugeot 206      False
Tiba              True
Nissan Junior     True
Peykan Vanet     False
renault 5        False
Name: price, dtype: bool

In [59]:
df[df.price > 110]

               Color   HP  Weight (KG)  price
BMW X6         White  335         2320   2400
Tiba           White   87         1027    120
Nissan Junior   Blue   93         1540    230

![](https://quera.org/qbox/view/rHA0rGQKi0/sharti.gif)

In [61]:
df[ (df.Color == "Red") & (df.price < 50)]

       Color  HP  Weight (KG)  price
Peykan   Red  48          990     33

In [62]:
df[df.price > 110][["Color" , "price"]]

               Color  price
BMW X6         White   2400
Tiba           White    120
Nissan Junior   Blue    230

In [63]:
condition_1 = df.Color == "Red"
condition_2 = df.Color == "White"
condition_3 = df.HP < 100

df[(condition_1) | ((condition_2) & condition_3)]

              Color  HP  Weight (KG)  price
Peykan          Red  48          990     33
Tiba          White  87         1027    120
Peykan Vanet    Red  80          960     68

test